package Homeworks;

/*
* 1) В класс BankAcoount добавить 2 метода. Первый метод для пополнения счета, который будет увеличивать баланс на сумму, которая будет указана в параметре этого метода. Второй метод будет служить для снятия средств со счета
* 2) Изменить класс StudentTest так, чтобы среднюю арифметическую оценку студента выводил на экран метод. То есть создать один метод, параметр которого - объект класса Student, а в теле метода будет вычисляться среде=няя арифметическая оценка и выводиться на экран.
* 3) Создать класс Employee с атрибутами: id, surname, age, salary, department, которые должны задаваться в конструкторе. В данном классе также создайте метод увеличения зарплаты вдвое. Создайте второй класс EmployeeTest, в котором создайть два объекта Employee. Увеличть запралту каждому работнику вдвое с помощью метода и вывести на экран значение новой зарплаты.
*/

public class Lesson5 {
}
